/* mermaid rexx macro */
/*---------------------------------------------------------------*/
/* program: mermaid.spf                                          */
/* function:                                                     */
/*          generate mermaid flowcharts from                     */
/*          jcl job, exec, and dd statements                     */
/*---------------------------------------------------------------*/
/* Create a temporary member and copy your JCL into it           */
/* invoke this exec and save the result as a *.md / *.mmd file   */
/* Paste into any Mermaid renderer to view the flowchart         */
/*---------------------------------------------------------------*/
address isredit 'macro'
address isredit '(firstr)  = linenum .zfirst'
address isredit '(lastr)   = linenum .zlast'

last  = lastr
call readit
address isredit 'up max'
tstr = 0
cnt = 0
exe = 0
sgopn = 0
i = 0
o = 0
x = 0
shp = 0
hld = 0
lnk = 0
call deletit

do until (x = lastr)
  cnt = 0
  x = x + 1
  linea = array.x
  call clearit
  parse var linea test1 test2 test3 test4 test5 test6 test7 test8 test9
  cnt = pos('//*',linea)
  if cnt>0  then do
    cnt = 0
  end
  else do
    tstr = pos('//',linea)
    if tstr>0 then call elsejcl
  end
end
/* End of JOB terminator node + link from last EXEC */
call sgclose
shp = shp + 1
call node shp, '([', 'End of JOB', '])'
call link exe, shp

address isredit 'reset'
address isredit 'up max'
address isredit 'unnum'
iadsfin = ' '
address ispexec;
"vput (iadsfin) profile"
         zedsmsg = 'function completed succesfully'
         zedlmsg = 'exit to your member to view your mermaid code'
         address ispexec 'setmsg msg(isrz001)'
exit
/*  */
readit:
  i = 0
  do while (i < lastr)
    i = i + 1
    address isredit '(linex) = line 'i
    if rc <> 0 then return
    array.i = linex
  end
  return
/*  */
deletit:
    address isredit 'delete all nx'
      if rc <> 0 then return
    /* Mermaid header */
    address isredit 'CAPS = OFF'
    ms = '%% Flowchart generated FOR TULIPS'
    address isredit "line_after .zl = '"ms"'"
    o = o + 1
    ms = 'flowchart TD'
    address isredit "line_after .zl = '"ms"'"
    o = o + 1
  return
/*  */
/* ---- helper: write a node.  usage: call node id, 'shapetext' ---- */
node:
  parse arg nid, opn, ntxt, cls
  m = '    N'||nid||opn||'"'||ntxt||'"'||cls
  o = o + 1
  address isredit "line_after .zl = '"m"'"
  return
/* ---- helper: write a link.  usage: call link fromid, toid ---- */
link:
  parse arg lf, lt
  if lf < 1 then lf = 1
  m = '    N'||lf||' --> N'||lt
  o = o + 1
  address isredit "line_after .zl = '"m"'"
  return
/*  */
elsejcl:
   if test2 > ' ' then do
   select
     when test2 = 'JOB'    then call jcljob
     when test2 = 'PROC'   then call jclprc
     when test2 = 'PEND'   then call pendr
     when test2 = 'EXEC'   then call jclexe
     when test2 = 'DD'     then call jcldd
     when test2 = 'OUTPUT' then call jclout
     otherwise
     m = 'a'
    end
  end
  return
/*  */
/* open a subgraph */
sgopen:
  parse arg sgname
  address isredit "line_after .zl = '    subgraph "sgname"'"
  address isredit "line_after .zl = '    direction TB'"
  sgopn = 1                     /* <-- MUST set flag */
  return
/* close the currently-open subgraph, if any */
sgclose:
  if sgopn = 1 then do
    address isredit "line_after .zl = '    end'"
    sgopn = 0
  end
  return
jcljob:
    shp = shp + 1
    parse var test1 v1 '//' v2 ',' v3 .
    call node shp, '[/', 'Start JOB '||v2, '/]'
    if shp > 1 then call link shp-1, shp
  return
/*  */
jclprc:
    shp = shp + 1
    parse var test1 v1 '//' v2 ',' v3 .
    call node shp, '[[', 'START PROC '||v2 v3, ']]'
    if shp > 1 then call link shp-1, shp
  return
/*  */
jclexe:
    call sgclose                 /* close prior step's subgraph */
    shp = shp + 1
    exe = shp
    parse var test1 v1 '//' v2 ' ' v3 .
    cnt = wordpos('PGM=',test3)
    if cnt=1 then do
      parse var test3 'PGM=' v4 ',' v5
      opn = '(' ; cls = ')' ; ntxt = 'Step '||v2||' Pgm '||v4
      if v4 = 'SORT'   then do; opn='{'; cls='}'; ntxt=v2||' SORT'; end
      if v4 = 'ICEMAN' then do; opn='{'; cls='}'; ntxt=v2||' SORT'; end
    end
    else do
      parse var test3 v4 ',' v5
      opn = '(' ; cls = ')' ; ntxt = 'EXEC PROC '||v2||' '||v4 v5
    end
    /* link from previous step FIRST (links must be outside subgraph) */
    if hld > 1 then call link hld, shp
              else call link 2, shp
    /* now open this step's box and put the program node inside */
    call sgopen 'STEP_'||v2
    call node shp, opn, ntxt, cls
    return
/*  */
jclout:
    shp = shp + 1
    lnk = lnk + 1
    parse var test1 v1 '//' v2 ',' v3 .
    parse var test3 v4 ',' v5 .
    call node shp, '[\', v1||' '||v4, '\]'
    call link exe, shp
  return
/*  */
jcldd:
   if exe > 0 then do
    shp = shp + 1
    lnk = lnk + 1
    hld = exe
    parse var test1 v1 '//' v2 ',' v3 ' ' v6
    parse var test3 'DSN=' v4 ',' v5 .
    ntxt = '[('||v2||' '||v4||')]'          /* Disk Storage -> cylinder */
    IF test3 = '*' then ntxt = '[/'||v2||' '||v4||'/]'  /* deck of cards */
    cnt = wordpos('SYSOUT=',test3)
    if cnt=1  then do
      cnt = 0
      ntxt = '[\'||v2||' '||v4||'\]'        /* tagged/output document */
    end
    call node shp, '[\', v2||' '||v4, '\]'
    /* default: EXEC feeds this DD (output) */
    lf = exe
    lt = shp
    /* these are inputs -> DD feeds the EXEC (reverse arrow) */
    /*
    IF test3 = '*'        then do; lf = shp; lt = exe; end
    IF v2 = 'DD1'         then do; lf = shp; lt = exe; end
    IF v2 = 'DD3'         then do; lf = shp; lt = exe; end
    IF v2 = 'SYSIN'       then do; lf = shp; lt = exe; end
    IF v2 = 'SYSUT1'      then do; lf = shp; lt = exe; end
    IF v2 = 'SYSLIN'      then do; lf = shp; lt = exe; end
    IF v2 = 'SORTIN'      then do; lf = shp; lt = exe; end
    IF v2 = 'SORTIN01'    then do; lf = shp; lt = exe; end
    IF v2 = 'SORTIN1'     then do; lf = shp; lt = exe; end
    */
    call link lf, lt
   end
  return
/*  */
pendr:
    call sgclose                     /* close the last step */
    shp = shp + 1
    lnk = lnk + 1
    call node shp, '([', 'End of Proc', '])'
    call link exe, shp
  return
/*  */
clearit:
     test1 = ' '
     test2 = ' '
     test3 = ' '
     test4 = ' '
     test5 = ' '
     test6 = ' '
     test7 = ' '
     test8 = ' '
     test9 = ' '
  return
/*  */
